Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: ... and a name of a method that should compute the value of the header. It can either be a static method or a default method in this interface. The method can take either no parameters, a single String parameter or a single `io.quarkus.rest.client.reactive.ComputedParamContext` parameter (which is very useful for code that needs to compute headers based on method parameters and naturally complements `@io.quarkus.rest.client.reactive.NotBody`).
ja_jp: ... また、ヘッダーの値を計算するメソッドの名前を指定することもできます。このメソッドは、静的メソッドまたはこのインターフェイス内のデフォルトメソッドのいずれかにすることができます。メソッドは、パラメーターなし、単一の String パラメーター、または単一の `io.quarkus.rest.client.reactive.ComputedParamContext` パラメーターを取ることができます (これは、メソッドのパラメーターに基づいてヘッダーを計算する必要があるコードに非常に便利で、 `@io.quarkus.rest.client.reactive.NotBody` と自然に補完し合います）。

source: ... and more to come !
ja_jp: ... さらに多くの機能が追加予定です!

source: ... and more... (Other extensions might add to this)
ja_jp: ... その他多数... (他のエクステンションがこれに追加する可能性があります)

source: ... as well as a value from your application's configuration
ja_jp: ... また、アプリケーションの設定値も使用します。

source: ... or as a normal JAX-RS `@HeaderParam` annotated argument
ja_jp: あるいは、通常の JAX-RS の `@HeaderParam` アノテーションされた引数として使用します。

source: ... or as a normal Jakarta REST `@HeaderParam` annotated argument
ja_jp: ... または、通常の Jakarta REST `@HeaderParam`アノテーション付き引数として使用できます。

source: ... or even any mixture of verbatim text, method parameters (referenced by name), a configuration value (as mentioned previously) and method invocations (as mentioned before)
ja_jp: ... または、逐語的なテキスト、メソッドパラメーター (名前で参照)、設定値 (前述のとおり)、メソッド呼び出し (前述のとおり) の任意の組み合わせでもかまいません。

source: ... we remove it from the bytecode by returning `null`.
ja_jp: ... `null` を返すことで、バイトコードからそれを削除します。

source: ...this starts with our adoption of Quarkus.
ja_jp: ...これはQuarkusの採用から始まっています。

source: // Source: {{source}}
ja_jp: // ソース: {{source}}

source: 1 - The *starting point* presents the quickstart app that uses OpenTracing
ja_jp: 1 - *開始点*では、OpenTracing を使用するクイックスタートアプリケーションを紹介します。

source: 1) Add the `junit-virtual-threads` dependency to your project:
ja_jp: 1) プロジェクトに `junit-virtual-threads` の依存関係を追加します:

source: 1) Add the `junit5-virtual-threads` dependency to your project:
ja_jp: 1) `junit5-virtual-threads` の依存関係をプロジェクトに追加します：

source: 1) Add trace/span identifiers to your event
ja_jp: 1) イベントへのトレース/スパン識別子の追加

source: 1) Locate the line with `<maven.compiler.release>17</maven.compiler.release>`, and replace it with:
ja_jp: 1) `<maven.compiler.release>17</maven.compiler.release>` の行を探し、次のように置換します:

source: 1) the generated content encryption key is encrypted by the key supplied with the API using the key encryption algorithm such as `RSA-OAEP` 2) the claims are encryped by the generated content encryption key using the content encryption algorithm such as `A256GCM`.
ja_jp: 1) 生成されたコンテンツ暗号化キーは、 `RSA-OAEP` などのキー暗号化アルゴリズムを使用して、API で提供されたキーによって暗号化されます。 2) クレームは、 `A256GCM` などのコンテンツ暗号化アルゴリズムを使用して、生成されたコンテンツ暗号化キーによって暗号化されます。

source: 1) the generated content encryption key is encrypted by the key supplied with the API using the key encryption algorithm such as `RSA-OAEP` 2) the claims are encrypted by the generated content encryption key using the content encryption algorithm such as `A256GCM`.
ja_jp: 1) 生成されたコンテンツ暗号化キーは、 `RSA-OAEP` などのキー暗号化アルゴリズムを使用して、API で提供されたキーによって暗号化されます。 2) クレームは、 `A256GCM` などのコンテンツ暗号化アルゴリズムを使用して、生成されたコンテンツ暗号化キーによって暗号化されます。

source: 1. Build your application as `mutable-jar`
ja_jp: 1. `mutable-jar` として、アプリケーションを構築します。

source: 1. Specification Alignment
ja_jp: 1. 仕様への対応

source: 1. System properties set in the Quarkus Maven plugin configuration
ja_jp: 1. Quarkus Maven プラグイン設定で設定されたシステムプロパティー

source: 1.1 Using variables inside translations
ja_jp: 1.1 翻訳内での変数の使用

source: 1.10.3.Final fixes issues and comes with documentation improvements.
ja_jp: 1.10.3.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.10.3.Final is a maintenance release fixing bugs and improving the documentation.
ja_jp: 1.10.3.Finalは、バグの修正とドキュメントの改善を行うメンテナンスリリースです。

source: 1.10.5.Final fixes several important issues in Quarkus 1.10.
ja_jp: 1.10.5.Finalでは、Quarkus 1.10のいくつかの重要な問題が修正されました。

source: 1.10.5.Final is a maintenance release.
ja_jp: 1.10.5.Final はメンテナンスリリースです。

source: 1.11 is an important milestone as it marks the beginning of two amazing new features:
ja_jp: 1.11は、2つの驚くべき新機能の始まりを示す重要なマイルストーンです:

source: 1.11.1.Final fixes issues and comes with documentation improvements.
ja_jp: 1.11.1.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.11.1.Final is a maintenance release fixing bugs and improving the documentation.
ja_jp: 1.11.1.Finalは、バグの修正とドキュメントの改善を行うメンテナンスリリースです。

source: 1.11.1.Final is a safe upgrade for everyone using Quarkus 1.11.
ja_jp: 1.11.1.Finalは、Quarkus 1.11を使用しているすべての人にとって安全なアップグレードです。

source: 1.11.2.Final fixes issues and comes with documentation improvements.
ja_jp: 1.11.2.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.11.2.Final is a maintenance release fixing bugs and improving the documentation.
ja_jp: 1.11.2.Final は、バグの修正とドキュメントの改善を行うメンテナンスリリースです。

source: 1.11.3.Final mainly fixes a regression introduced in 1.11.2.Final that makes it impossible to build native executables while using both the RESTEasy and OpenTracing extensions.
ja_jp: 1.11.3.Finalは主に1.11.2.Finalで導入された、RESTEasy と OpenTracing の両方のエクステンションを使用している場合にネイティブ実行可能ファイルをビルドできないようにするリグレッションを修正しています。

source: 1.11.3.Final mainly fixes a regression when using OpenTracing in combination with RESTEasy in a native executable.
ja_jp: 1.11.3.Finalでは主に、ネイティブ実行可能ファイルでRESTEasyと組み合わせてOpenTracingを使用する際のリグレッションを修正しました。

source: 1.12.1.Final fixes issues and comes with documentation improvements.
ja_jp: 1.12.1.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.12.1.Final is a maintenance release fixing bugs and improving the documentation.
ja_jp: 1.12.1.Finalは、バグの修正とドキュメントの改善を行うメンテナンスリリースです。

source: 1.12.1.Final is a safe upgrade for everyone using Quarkus 1.12.
ja_jp: 1.12.1.Finalは、Quarkus 1.12を使用しているすべての人にとって安全なアップグレードです。

source: 1.12.2.Final fixes issues and comes with documentation improvements.
ja_jp: 1.12.2.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.12.2.Final fixes two important regressions that were introduced in 1.12.1.Final:
ja_jp: 1.12.2.Finalでは、1.12.1.Finalで発生した2つの重要なリグレッションが修正されています。

source: 1.12.2.Final is a maintenance release fixing bugs and improving the documentation.
ja_jp: 1.12.2.Finalは、バグの修正とドキュメントの改善を行ったメンテナンスリリースです。

source: 1.13.1.Final fixes issues and comes with documentation improvements.
ja_jp: 1.13.1.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.13.1.Final is a maintenance release fixing bugs and improving the documentation.
ja_jp: 1.13.1.Finalは、バグの修正とドキュメントの改善を行ったメンテナンスリリースです。

source: 1.13.1.Final is a safe upgrade for everyone using Quarkus 1.13.
ja_jp: 1.13.1.Finalは、Quarkus 1.13を使用しているすべての人にとって安全なアップグレードです。

source: 1.13.2.Final introduces an extension for the Oracle JDBC driver and fixes bugs
ja_jp: 1.13.2.Final では、Oracle JDBC ドライバーのエクステンションを導入し、バグを修正しました。

source: 1.13.2.Final is a safe upgrade for everyone using Quarkus 1.13.
ja_jp: 1.13.2.Finalは、Quarkus 1.13を使用しているすべての人にとって安全なアップグレードです。

source: 1.13.3.Final is a maintenance release for our 1.13 release train.
ja_jp: 1.13.3.Final は、1.13 リリーストレインのメンテナンスリリースです。

source: 1.13.3.Final is a safe upgrade for everyone using Quarkus 1.13.
ja_jp: 1.13.3.Finalは、Quarkus 1.13を使用しているすべての人にとって安全なアップグレードです。

source: 1.13.4.Final is a maintenance release for our 1.13 release train.
ja_jp: 1.13.4.Final は、1.13 リリーストレインのメンテナンスリリースです。

source: 1.13.4.Final is a safe upgrade for everyone using Quarkus 1.13.
ja_jp: 1.13.4.Finalは、Quarkus 1.13を使用しているすべての人にとって安全なアップグレードです。

source: 1.13.5.Final is a maintenance release for our 1.13 release train.
ja_jp: 1.13.5.Final は、1.13 リリーストレインのメンテナンスリリースです。

source: 1.13.5.Final is a safe upgrade for everyone using Quarkus 1.13.
ja_jp: 1.13.5.Finalは、Quarkus 1.13を使用しているすべての人にとって安全なアップグレードです。

source: 1.13.6.Final is a maintenance release for our 1.13 release train.
ja_jp: 1.13.6.Final は、1.13 リリーストレインのメンテナンスリリースです。

source: 1.13.6.Final is a safe upgrade for everyone using Quarkus 1.13.
ja_jp: 1.13.6.Finalは、Quarkus 1.13を使用しているすべての人にとって安全なアップグレードです。

source: 1.13.7.Final is a maintenance release for our 1.13 release train.
ja_jp: 1.13.7.Final は、1.13 リリーストレインのメンテナンスリリースです。

source: 1.8 introduced a new Micrometer extension. During the 1.9 development cycle, it matured a lot and is now the recommended way to collect metrics in Quarkus.
ja_jp: 1.8 では、新しく Micrometer エクステンションが導入されました。1.9 の開発サイクルの間に、このエクステンションは大きく発展し、現在では Quarkus でメトリクスを収集するための推奨される方法となっています。

source: 1.8 introduces support for multiple persistence units in the Hibernate ORM extension. The feature is still experimental, not because it's unstable, but because we might tweak how you configure it depending on your feedback. So if you use this feature, please provide your feedback on Zulip or on our `quarkus-dev` mailing list.
ja_jp: 1.8 では、Hibernate ORM エクステンションに複数の永続化ユニットのサポートが導入されています。この機能はまだ実験的なもので、不安定だからというわけではありません。ですから、もしこの機能を使っているのであれば、Zulip や `quarkus-dev` メーリングリストでフィードバックをお願いします。

source: 1.9.1.Final fixes issues and comes with documentation improvements.
ja_jp: 1.9.1.Final では、問題が修正され、ドキュメントが改善されています。

source: 1.9.2.Final fixes issues and comes with documentation improvements.
ja_jp: 1.9.2.Final では、問題が修正され、ドキュメントが改善されています。

source: 10 minutes
ja_jp: 10 分

source: 10 seconds
ja_jp: 10 秒

source: 1000 by default, 3000 when an inclusive authentication is enabled
ja_jp: デフォルトで 1000、統合認証が有効な場合は 3000

source: 17 ms
ja_jp: 17 ミリ秒

source: 1:1 behavior
ja_jp: 1:1 の動作再現

source: 2 - The first part is good for anyone performing a *big bang change* of OpenTracing when you don't have any manual instrumentation
ja_jp: 2 - 最初の部分は、OpenTracing を *ビッグバン方式で変更* し、手動の計装が一切ない場合に適しています。

source: 2) In the maven-surefire-plugin and maven-failsafe-plugin configurations, add the following `argLine` parameter:
ja_jp: 2) maven-surefire-pluginおよびmaven-failsafe-plugin設定で、次の `argLine` パラメータを追加します:

source: 2) In your test case, add the `io.quarkus.test.junit.virtual.VirtualThreadUnit` and `io.quarkus.test.junit.virtual.ShouldNotPin` annotations:
ja_jp: 2) テストケースに、`io.quarkus.test.junit.virtual.VirtualThreadUnit` および `io.quarkus.test.junit.virtual.ShouldNotPin` アノテーションを追加します:

source: 2) In your test case, add the `io.quarkus.test.junit5.virtual.VirtualThreadUnit` and `io.quarkus.test.junit.virtual.ShouldNotPin` annotations:
ja_jp: 2) テストケースに、 `io.quarkus.test.junit5.virtual.VirtualThreadUnit` と `io.quarkus.test.junit.virtual.ShouldNotPin` のアノテーションを追加します：

source: 2) Populate the identifiers from the IdProducer
ja_jp: 2) IdProducer からの識別子の設定

source: 2. Deploy our Quarkus application
ja_jp: 2. Quarkusアプリケーションのデプロイ

source: 2. Modern Java: Standardized on Records
ja_jp: 2. モダンJava: レコードへの標準化

source: 2. Quarkus Maven plugin configuration properties
ja_jp: 2. Quarkus Maven プラグインの設定プロパティー

source: 2. Re-augment your application with a different build time configuration
ja_jp: 2. ビルド時の設定を変えて、アプリケーションを再ビルドする

source: 2.0 (Latest)
ja_jp: 2.0 (最新)

source: 2.0 coming soon
ja_jp: 2.0が間もなく登場

source: 2.0 is also a good moment to bring new features that, we believe, could change your daily coding for the better. The first one to come to life is called Continuous Testing.
ja_jp: 2.0は、日々のコーディングをより良いものに変えてくれると信じている新機能を提供する良い機会でもあります。最初に登場するのは、「継続的テスト」と呼ばれるものです。

source: 2.0.1.Final is a maintenance release for our 2.0 release train.
ja_jp: 2.0.1.Final は、2.0 リリーストレインのメンテナンスリリースです。

source: 2.0.2.Final is a maintenance release for our 2.0 release train.
ja_jp: 2.0.2.Final は、2.0 リリーストレインのメンテナンスリリースです。

source: 2.0.3.Final is a maintenance release for our 2.0 release train.
ja_jp: 2.0.3.Final は、2.0 リリーストレインのメンテナンスリリースです。

source: 2.1 adds a reactive driver extension for Microsoft SQL Server - `quarkus-reactive-mssql-client`.
ja_jp: 2.1では、Microsoft SQL Serverのリアクティブ・ドライバー・エクステンションが追加されています - `quarkus-reactive-mssql-client` 。

source: 2.1.1.Final is a maintenance release for our 2.1 release train.
ja_jp: 2.1.1.Final は、2.1 リリーストレインのメンテナンスリリースです。

source: 2.1.2.Final is a maintenance release for our 2.1 release train.
ja_jp: 2.1.2.Final は、2.1 リリーストレインのメンテナンスリリースです。

source: 2.1.3.Final is a maintenance release for our 2.1 release train.
ja_jp: 2.1.3.Final は、2.1 リリーストレインのメンテナンスリリースです。

source: 2.1.4.Final is a maintenance release for our 2.1 release train.
ja_jp: 2.1.4.Final は、2.1 リリーストレインのメンテナンスリリースです。

source: 2.10.0.CR1 introduced a major security issue known as CVE-2022-2466 in the SmallRye GraphQL server extension and all the 2.10.x releases are affected (together with 2.11.0.CR1). 2.10.3.Final fixes it and the fix will also be included in the upcoming 2.11.0.Final. You are only affected by this issue if you are exposing GraphQL services.
ja_jp: 2.10.0.CR1 では、SmallRye GraphQL サーバーエクステンションに CVE-2022-2466 という重大なセキュリティ問題があり、すべての 2.10.x リリースが影響を受けます (2.11.0.CR1 と合わせて)。2.10.3.Finalではこの問題が修正されており、次期2.11.0.Finalにもこの修正が含まれる予定です。この問題の影響を受けるのは、GraphQL サービスを公開している場合のみです。

source: 2.10.3.Final fixes CVE-2022-2466 and is a mandatory upgrade for anyone exposing GraphQL services with Quarkus 2.10.x.
ja_jp: 2.10.3.FinalではCVE-2022-2466が修正されており、Quarkus 2.10.xでGraphQLサービスを公開している場合はアップグレードが必須です。

source: 2.2 is our first hardening release, a full development cycle dedicated to fixing issues, improving usability and documentation and polishing things overall.
ja_jp: 2.2は初のハードニングリリースで、開発サイクル全体を問題の修正、使い勝手やドキュメントの改善、全体的な磨き上げに専念しました。

source: 2.2.2.Final is a maintenance release for our 2.2 release train.
ja_jp: 2.2.2.Finalは、2.2リリーストレインのメンテナンスリリースです。

source: 2.2.3.Final is a maintenance release for our 2.2 release train.
ja_jp: 2.2.3.Finalは、2.2リリーストレインのメンテナンスリリースです。

source: 2.3.1.Final is a maintenance release for our 2.3 release train.
ja_jp: 2.3.1.Final は、2.3 リリーストレインのメンテナンスリリースです。

source: 2.4.1.Final is a maintenance release for our 2.4 release train.
ja_jp: 2.4.1.Final は、2.4 リリーストレインのメンテナンスリリースです。

source: 2.4.2.Final is a maintenance release for our 2.4 release train.
ja_jp: 2.4.2.Final は、2.4 リリーストレインのメンテナンスリリースです。

source: 2.5.1.Final is a maintenance release for our 2.5 release train.
ja_jp: 2.5.1.Finalは、2.5リリーストレインのメンテナンスリリースです。

source: 2.5.2.Final is a maintenance release for our 2.5 release train.
ja_jp: 2.5.2.Finalは、2.5リリーストレインのメンテナンスリリースです。

source: 2.5.3.Final is a maintenance release for our 2.5 release train.
ja_jp: Quarkus 2.5.3.Finalは、バグ修正とドキュメントの改善を含む、Quarkus 2.5リリーストレインのメンテナンスリリースです。

source: 2.5.4.Final is a maintenance release for our 2.5 release train.
ja_jp: 2.5.4.Finalは、2.5リリーストレインのメンテナンスリリースです。

source: 2.6.1.Final is the first maintenance release for our 2.6 release train and the last Quarkus release of the year!
ja_jp: 2.6.1.Finalは、2.6リリーストレインの最初のメンテナンスリリースであり、今年最後のQuarkusリリースとなります。

source: 2.6.2.Final is a maintenance release for our 2.6 release train. It brings back Kogito.
ja_jp: 2.6.2.Finalは、2.6リリーストレインのメンテナンスリリースです。Kogitoが戻ってきました。

source: 2.6.3.Final is the third maintenance release for our 2.6 release train.
ja_jp: 2.6.3.Final は、2.6 リリーストレインの 3 回目のメンテナンスリリースです。

source: 2.7.0.Final comes with a lot of refinements and new features:
ja_jp: 2.7.0.Finalでは、多くの改良と新機能が追加されています。

source: 2.7.1.Final is the first maintenance release for our 2.7 release train.
ja_jp: 2.7.1.Final は、2.7 リリーストレインの最初のメンテナンスリリースです。

source: 2.7.1.Final reintroduces the Kogito extensions that were disabled for 2.7.0.Final due to an incompatibility. So if you are using Kogito, you can now upgrade your applications to 2.7.
ja_jp: 2.7.1.Finalでは、2.7.0.Finalでは非互換のために無効になっていたKogitoのエクステンションが再導入されています。そのため、Kogitoをお使いの方は、ご自分のアプリケーションを2.7にアップグレードすることができます。

source: 2.7.2.Final is the second maintenance release for our 2.7 release train.
ja_jp: 2.7.2.Final は、2.7 リリーストレインの 2回目のメンテナンスリリースです。

source: 2.7.3.Final is the third maintenance release for our 2.7 release train.
ja_jp: 2.7.3.Final は、2.7 リリーストレインの 3回目のメンテナンスリリースです。

source: 2.7.4.Final is the fourth maintenance release for our 2.7 release train.
ja_jp: 2.7.4.Final は、2.7 リリーストレインの 4 回目のメンテナンスリリースです。

source: 2.7.5.Final is the fifth maintenance release for our 2.7 release train.
ja_jp: 2.7.5.Final は、2.7 リリーストレインの 5 回目のメンテナンスリリースです。

source: 2.8.0.Final comes with a lot of refinements and new features:
ja_jp: 2.8.0.Finalでは、多くの改良と新機能が搭載されています。

source: 2.8.1.Final is the first maintenance release for our 2.8 release train.
ja_jp: 2.8.1.Final は、2.8 リリーストレインの最初のメンテナンスリリースです。

source: 2.8.2.Final is the second maintenance release for our 2.8 release train.
ja_jp: 2.8.2.Final は、2.8 リリーストレインの 2 回目のメンテナンスリリースです。

source: 2.8.3.Final is the third maintenance release for our 2.8 release train.
ja_jp: 2.8.3.Final は、2.8 リリーストレインの 3 回目のメンテナンスリリースです。

source: 2.9.1.Final is the first maintenance release for our 2.9 release train.
ja_jp: 2.9.1.Final は、2.9 リリーストレインの最初のメンテナンスリリースです。

source: 2.9.2.Final is the second maintenance release for our 2.9 release train.
ja_jp: 2.9.2.Final は、2.9 リリーストレインの 2 番目のメンテナンスリリースです。

source: 2020 Awards and Nominations
ja_jp: 2020年の受賞とノミネート

source: 2021 Awards and Nominations
ja_jp: 2021年の受賞とノミネート

source: 2021 has been a tremendous year for Quarkus and today we officially close our 2021 release season with the last maintenance release of the year: 2.6.1.Final is available on Maven Central and ready for consumption!
ja_jp: 2021年はQuarkusにとって非常に素晴らしい年となりました。本日、今年最後のメンテナンスリリースで2021年のリリースシーズンを正式に終了します。2.6.1.FinalはMaven Centralで公開されており、すぐに使用することができます。

source: 242 ms
ja_jp: 242 ミリ秒

source: 3 - This is the *big bang replacement* of OpenTracing when you have manually instrumented the code. We explain the main differences between OpenTracing and OpenTelemetry
ja_jp: 3 - これは、手動でコードを計装した場合の OpenTracing の *ビッグバン方式の置換* です。OpenTracing と OpenTelemetry の主な違いを説明しています。

source: 3 minutes
ja_jp: 3 分

source: 3,189 ms
ja_jp: 3,189 ミリ秒

source: 3. Create a Service monitor in our project
ja_jp: 3. プロジェクトにサービスモニターを作成

source: 3. Optional: Delete the deployments folder
ja_jp: 3. オプション: deployments フォルダの削除

source: 3. Project properties
ja_jp: 3. プロジェクトプロパティ

source: 3. Protocol Buffers as Source of Truth
ja_jp: 3. Protocol Buffersを信頼できる唯一の情報源として

source: 3.0.0.Alpha1 and 3.0.0.Alpha2 changelogs are empty as these versions were just a transformation of Quarkus 2 versions to Jakarta EE 10
ja_jp: 3.0.0.Alpha1 と 3.0.0.Alpha2 の変更履歴は、Quarkus 2 のバージョンを Jakarta EE 10 に変換しただけなので、空です。

source: 370 ms
ja_jp: 370 ミリ秒

source: 4 - The last part uses the *OpenTracing shim*. This is useful if you have a large application with manually instrumented code. It can help performing the migration step by step because it allows the use of the legacy OpenTracing API on top of new OpenTelemetry API
ja_jp: 4 - 最後の部分では、*OpenTracing シム* を使用します。これは、手動で計装されたコードを含む大規模なアプリケーションがある場合に便利です。新しい OpenTelemetry API 上でレガシーの OpenTracing API を使用できるため、移行を段階的に実行するのに役立ちます。

source: 4. Bill of Materials (BOMs)
ja_jp: 4. 部品表 (BOM)

source: 5 - Conclusion and additional resources
ja_jp: 5 - 結論と関連情報

source: 5 min
ja_jp: 5 分

source: 5 minutes
ja_jp: 5 分

source: 5. Enhanced API Documentation
ja_jp: 5. APIドキュメントの強化

source: 6. Additional Improvements
ja_jp: 6. 追加の改善点

source: 80 ms
ja_jp: 80 ミリ秒

source: 924 ms
ja_jp: 924 ミリ秒

source: <<#podman,Podman>>
ja_jp: xref:podman[Podman]

source: <<adding-full-pages,Full custom pages>>
ja_jp: link:#adding-full-pages[フルカスタムページ]

source: <<advanced-usage-adding-actions,Interactive pages with actions>>
ja_jp: link:#advanced-usage-adding-actions[アクション付きのインタラクティブページ]

source: <<annotations,Annotate>> a method
ja_jp: メソッドに <<annotations,アノテーションを付与>> します。

source: <<automatic-integration,Automatic integrations>> will **not** work with programmatically-created `ConnectionProvider`. This implies all these integrations, including those from other Quarkus modules (e.g. xref:smallrye-health.adoc[SmallRye Health]) must be done manually.
ja_jp: xref:automatic-integration[自動統合] は、プログラムで作成された `ConnectionProvider` では機能 *しません* 。 このため、他のQuarkusモジュール（ xref:smallrye-health.adoc[SmallRye Health] ）などからの統合を含め、これらの統合はすべて手動で行う必要があります。

source: <<build-items,Build items>> produced by previous build steps
ja_jp: <<build-items,Build items>> 以前のビルドステップで生成されたもの

source: <<configuration,Configuration Mapping>> types
ja_jp: <<configuration,Configuration Mapping>> 種類

source: <<configuration-roots,Configuration root>> types
ja_jp: link:#configuration-roots[設定ルート]の種類

source: <<custom-http-security-policy>> will be also applied on the `/admin/1` path together with the `admin-policy1` policy.
ja_jp: <<custom-http-security-policy>> は、 `admin-policy1` ポリシーとともに `/admin/1` パスにも適用されます。

source: <<how-can-i-make-my-extension-support-the-dev-ui,Custom useful bits of runtime information in the overview>>
ja_jp: link:#how-can-i-make-my-extension-support-the-dev-ui[カスタムのランタイム情報の概要]

source: <<logging-adapters-commons-logging,Commons Logging adapter>>
ja_jp: <<logging-adapters-commons-logging,Commons Logging アダプター>>

source: <<logging-adapters-log4j,Log4j 1 adapter>>
ja_jp: <<logging-adapters-log4j,Log4j 1 アダプター>>

source: <<logging-adapters-log4j2,Log4j 2 adapter>>
ja_jp: <<logging-adapters-log4j2,Log4j 2 アダプター>>

source: <<logging-adapters-slf4j,SLF4J adapter>>
ja_jp: <<logging-adapters-slf4j,SLF4J アダプター>>

source: <<marked-up-data,Marked-up data>>
ja_jp: <<marked-up-data,マークアップされたデータ>>

source: <<non-blocking-methods,Non-blocking methods>> are not supported, i.e. a new span is associated with the _actual_ invocation but it's not available within the asynchronous computation.
ja_jp: link:#non-blocking-methods[ノンブロッキングメソッド] はサポートされていません。つまり、新しいスパンは _実際の_ 呼び出しに関連付けられますが、非同期計算の中では利用できません。

source: <<producing-values,Build producers>> to produce items for subsequent build steps
ja_jp: <<producing-values,Build producers>> 後続のビルドステップのアイテムを生産するために

source: <<registry.quarkus.io,registry.quarkus.io>> is the default registry which normally does not have to be configured explicitly, however if a user provides a custom registry list and `registry.quarkus.io` is not in it, <<registry.quarkus.io,registry.quarkus.io>> will *not* be enabled.
ja_jp: <<registry.quarkus.io,registry.quarkus.io>> はデフォルトのレジストリで、通常は明示的に設定する必要はありませんが、ユーザーがカスタムレジストリリストを提供し、その中に `registry.quarkus.io` が含まれていない場合は、 <<registry.quarkus.io,registry.quarkus.io>> は有効になりません。

source: <<template_data,`@TemplateData`>> and <<convenient-annotation-for-enums,`@TemplateEnum`>> annotations are ignored.
ja_jp: <<template_data,`@TemplateData`>> と <<convenient-annotation-for-enums,`@TemplateEnum`>> の注釈は無視されます。

source: <<template_data,`@TemplateData`>> annotations are ignored.
ja_jp: <<template_data,`@TemplateData`>> アノテーションは無視されます。

source: <<template_extension_methods,`@TemplateExtension` methods>> will not work.
ja_jp: <<template_extension_methods,`@TemplateExtension` methods>> は動作しません。

source: <<type-safe-message-bundles,Type-safe message bundles>> are not supported.
ja_jp: <<type-safe-message-bundles,Type-safe message bundles>> はサポートされていません。

source: <<typesafe_expressions>> are not validated.
ja_jp: <<typesafe_expressions>> は検証されていません。

source: <<user-initiated-logout,User-initiated logout>> will log the user out of the OIDC provider. If it is used as a single sign-on, it might not be what you require. If, for example, your OIDC provider is Google, you will be logged out of Google and its services. Instead, the user might just want to log out of that specific application. Another use case might be when the OIDC provider does not have a logout endpoint.
ja_jp: <<user-initiated-logout,ユーザー開始ログアウト>> は、ユーザーを OIDC プロバイダーからログアウトします。 これをシングルサインオンとして使用する場合は、必要とするものではない可能性があります。 たとえば、OIDC プロバイダーが Google の場合、Google とそのサービスからログアウトされます。 代わりに、ユーザーはその特定のアプリケーションからログアウトしたいだけかもしれません。 もう 1 つのユースケースとしては、OIDC プロバイダーにログアウトエンドポイントがない場合が考えられます。
